Revit 2024 API
ParameterTypeId.ProfileAngle Property
 "Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ProfileAngle { get; }
Visual Basic
Public Shared ReadOnly Property ProfileAngle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ProfileAngle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace